Revit 2027 API
Element.GetChangeTypeElementDeletion Method
 Returns ChangeType associated with element deletion.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ChangeType GetChangeTypeElementDeletion()
Public Shared Function GetChangeTypeElementDeletion As ChangeType
public:
static ChangeType^ GetChangeTypeElementDeletion()
static member GetChangeTypeElementDeletion : unit -> ChangeType
Return Value
ChangeType
 ChangeType that can be used to define a trigger for an Updater, triggering on element deletion.
Remarks
 ChangeType that can be used to define a trigger for an Updater, Use this change type to trigger an Updater on the deletion of elements from a document. Note: This change type will not trigger on changes caused by Undo and Redo.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace